# 1) Прокомментируйте каждую строчку кода из предыдущего упражнения.

"""
1) .
2) .
3) Измените значение переменной на 15.
4) Выведите значение переменной в таком виде: «Значение переменной ИМЯ_ПЕРЕМЕННОЙ равно ЗНАЧЕНИЕ_ПЕРЕМЕННОЙ».
    То есть должно получиться примерно так: «Значение переменной abc равно 15».
5) Создайте 2 строковые переменные со значениями: «C» и «равно».
6) Выведите аналогичную строку из пункта 4, но с использованием переменных из пункта 5.
7) Создайте 2 булевских переменных со значениями: True и False.
8) Выведите их так, как написано в 6 пункте (то есть с использованием строковых переменных).
"""

num=10 # Создайте переменную со значением 10

print(num) # Выведите данную переменную с помощью функции print()

num=15 # Измените значение переменной на 15

print("Значение переменной numравно", num) # Значение переменной abc равно 15

word1="C" # Создание строковой переменной со значением «равно»
word2 ="равно" # Создание строковой переменной со значением «равно»

print(word1, word2, num) # Выведите аналогичную строку из пункта 4, но с использованием переменных из пункта 5.

a=True # Создание булевской переменнойсо значением True.
b= False # Создание булевской переменнойсо значением False.

print("Значение переменной a", a) #Вывод с использованием строковых переменных
print("Значение переменной b", b) #Вывод с использованием строковых переменных