"""
1) Попросите пользователя ввести 3 числа.
2) Выведите пользователю среднее арифметическое этих чисел.
Примечание: среднее арифметическое чисел равно сумме этих чисел поделённое на их количество.
"""

number1 = input("Введите первое число")
number2 = input("Введите второе число")
number3 = input("Введите третье число")

print("Cреднее арифметическое =", (int(number1) + int(number2) + int(number3))/3)
