"""
1) Создайте переменную со значением 10.
2) Выведите данную переменную с помощью функции print().
3) Измените значение переменной на 15.
4) Выведите значение переменной в таком виде: «Значение переменной ИМЯ_ПЕРЕМЕННОЙ равно ЗНАЧЕНИЕ_ПЕРЕМЕННОЙ».
    То есть должно получиться примерно так: «Значение переменной abc равно 15».
5) Создайте 2 строковые переменные со значениями: «C» и «равно».
6) Выведите аналогичную строку из пункта 4, но с использованием переменных из пункта 5.
7) Создайте 2 булевских переменных со значениями: True и False.
8) Выведите их так, как написано в 6 пункте (то есть с использованием строковых переменных).
"""

num=10

print(num)

num=15

print("Значение переменной numравно", num)

word1="C"
word2 ="равно"

print(word1, word2, num)

a=True
b= False

print("Значение переменной a", a)
print("Значение переменной b", b)